---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpacingLayoutHoriz
source: html/961de551-8ed8-e1bf-7fd7-a0dbae0060bd.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpacingLayoutHoriz Property

"Layout"

## Syntax (C#)
```csharp
public static ForgeTypeId SpacingLayoutHoriz { get; }
```